<template>
    <ul id="card-carousel">
        <!-- <li class='card-frame' v-for="cardEntityIndex in this.lengthOfGenericData" :key="cardEntityIndex">
                <CongratulationFrame :offset_index="cardEntityIndex" main_context="{{this.cardsGenericData[cardEntityIndex]}}" signature="{{this.cardsGenericData[cardEntityIndex]}}"/>
        </li> -->
        <li class='card-frame'>
            <CongratulationFrame offset_index="1"
                                 main_content="Дорогие наши дамы! 
По праву вас можно назвать сердцем нашего замечательного коллектива, который именно вы наполняете теплом и уютом. Не сосчитать слов нашей благодарности и признательности вам за ваш усердный труд и упорство, с которым вы помогаете нам в совместной работе над одним общим делом. Хочу пожелать вам великого терпения, ведь порой всем приходится нелегко, но я верю, что с вашими талантами и креативом, вы сможете найти выход из любом ситуации. Оставайтесь такими же солнечными и неотразимыми, пусть улыбки не покидают ваши лица, а радость ваши сердца!"
                                 signature="Артур Камалеев"
                                 signature_url="https://t.me/arturkamaleev" 
                                 logo_url="@assets/Kamalev.jpg" />
        </li>
        <li class='card-frame'>
            <CongratulationFrame offset_index="2"
                                 main_content="Дорогие вы наши) Мы знакомы не так давно, но уже много чего успели пройти вместе и я понял, как же мне повезло, что я попал в такую дружную команду. Хоть я и не так часто пишу в чат, но от себя хотел поздравить каждую из вас, потому что работать с такими коллегами - одно удовольствие, вы самые лучшие!!!"
                                 signature="Никита Остроглядов"
                                 signature_url="https://t.me/Nik_osn"
                                 logo_url="@assets/Ostrogov.jpg" />
        </li>
        <li class='card-frame'>
            <CongratulationFrame offset_index="3"
                                 main_content="Дорогие дамы, в этот знаменательный день хочу вас поздравить с 8 марта! Желаю вам здоровья, творческих успехов, радости, удачи в любых начинаниях, оставайтесь такими же позитивными и радостными, пусть все ваши желания исполнятся и чтоб настроение было просто пушка, бомба, пулемёт"
                                 signature="Анатолий Дегтярев" 
                                 signature-url="https://t.me/aa_degtyarev" 
                                 logo_url="@assets/Degtyarov.jpg"/>
        </li>
        <li class='card-frame'>
            <CongratulationFrame offset_index="4"
                                 main_content="Девушки!
От всей души поздравляю вас с Международным женским днем! 
Оставайтесь такими же солнечными красавицами, вдохновляйтесь, вдохновляйте нас и всех вокруг!
Пусть сегодня вас засыплют комплиментами, вы этого заслуживаете 😉
Желаю теплых эмоций, побольше светлых улыбок и счастливых минут!"
                                 signature="Артём Альбицкий"
                                 signature-url="https://t.me/@altairkin"
                                 logo_url="@assets/Albitsky.jpg"/>
        </li>
        <li class='card-frame'>
            <CongratulationFrame offset_index="5"
                                 main_content="Хочу поздравить с этим праздником, международным женским днём! Не буду желать тебе быть самой красивой, умной и так далее, потому что ты уже😉 
Хочу пожелать тебе счастья и, чтобы вокруг тебя было много крутых людей, которые готовы прийти на помощь и поддержать. Иди к своей цели и никогда не сдавайся, с 8 марта!"
                                 signature="Андрей Чумаков"
                                 signature-url="https://t.me/chureya"
                                 logo_url="@assets/"/>
        </li>
        <li class='card-frame'>
            <CongratulationFrame offset_index="6"
                                 main_content="Невероятной тебе,

Привет, взгляни на себя в зеркало, и подумай, кого ты сегодня в нем видишь? 

А знаешь, кого вижу я? Молодую и энергичную 💃🏼 девушку, которая уже добилась успехов ✌️ в профессиональной, учебной или общественной деятельности при этом не потеряв, а только приобретя, те навыки, которые сделали тебя той, какая ты есть) 

Честно - мне повезло знать тебя, общаться и работать уже достаточно долгое время. За эти месяцы, недели, дни - одним словом временные рамки, я понял про тебя одну замечательную истину . Ты таишь в себе волшебство 🧞‍♀️✨) Я вижу его, и эта магия проявляется в твоей неиссякаемой энергии, безудержном позитиве и индивидуальной изюминке, которая бесспорно есть (поверь мне - ведь я ее правда вижу 😉)! 

Ты - волшебная 🧝🏼‍♀️

В команде ты делаешь большое дело, которое прямо влияет на результат 📈 нашей команды и успех Всероссийского Движения Вдохновители 🌄 в общественном онлайн пространстве 🌌 - вообщем ты с нами не просто так. Ты в команде, потому что твоя магия реальна, потому что твои навыки - лучше, ум - острее, а потенциал реализуется масштабнее - чем у кого-то еще! Спасибо, что ты выбрала стать частью сообщества Вдохновителей)

Хорошенько выдохни, отвлекись от всего, что происходит, да, выключи мир на минутку, что бы там не происходило и помечтай 🌇 о том, как ты хочешь жить и в кого ты хочешь вырасти через какое-то время. Представила? Уверен, в будущем ты еще круче, чем сейчас) Я верю в тебя!

Так вот - вперед 🔥! Желаю побольше сил в сложном, романтики в простом, невероятного - в других, и душевности - в мире) А дальше ты сама) С 8м марта! 
"
                                signature="Ниикта Телетов"
                                signature_url="https://t.me/kyrgun"
                                logo_url="@assets/Teletov.jpg" />
        </li>
    </ul>
  

</template>

<script lang="ts">
import { defineComponent } from 'vue';
import CongratulationFrame from "@/components/CongratulationFrame.vue";
const start_position = 1;

const cards_generic_data = [{main_context: "Здесь могла быть ваша", signature: "Абоба"},
                            {main_context: "Здесь тоже", signature: "генерал Гавс"},
                            {main_context: "А здесь?", signature: "ФФФФ"}]

const generic_data_length = cards_generic_data.length;



export default defineComponent({
    name: 'FrameCarousel',
    props: {},
    components: {
        CongratulationFrame
    },
    data () {
        return{
            cardsGenericData: cards_generic_data,
            lengthOfGenericData: generic_data_length}
    },
    mounted(){
        var styling_object = document!.getElementById("card-carousel");
        if (styling_object){
            styling_object.style.setProperty("--card-frame", ""+generic_data_length);
            styling_object.style.setProperty("--position", ""+start_position)
        }
    }
});
</script>

<style>

ul#card-carousel {
    height: 100vw;
    width: auto;
    display: flex;
    justify-content: center;
    overflow: hidden;
    transform-style: preserve-3d;
    perspective: 30vw;
    list-style-type: none;
}

li.card-frame {
    position: absolute;
    --radius: calc(var(--position) - var(--offset));
    --abs: max(calc(var(--radius) * -1), var(--radius));
    transition: all 0.25s linear;
    transform: rotateY(calc(-10deg * var(--radius)))
    translateX(calc(-30vw * var(--radius)));
    filter: drop-shadow(0 0 2vw rgba(7, 7, 7, 0.25));
    z-index: calc((var(--position) - var(--abs)));
    max-width: 50%;

} 


@media screen and (orientation: portrait ) {
    body {
        font-size: 60%;    
    }

    ul#card-carousel {
        padding: 25%;
        display: block;
    }

    li.card-frame {
        position: absolute;
        --radius: calc(var(--position) - var(--offset));
        --abs: max(calc(var(--radius) * -1), var(--radius));
        transition: all 0.35s linear;
        transform: rotateX(calc(10deg * var(--radius)))
            translateY(calc(-30vw * var(--radius)));
        z-index: calc((var(--position) - var(--abs)));
        max-width: 200%;
        height: auto;
    } 
}
</style>